Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ2048EFG100.atdf
         <register caption="" name="SRCON1B" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR1B0"/>
            <bitfield mask="0x00000002" name="SR1B1"/>
            <bitfield mask="0x00000004" name="SR1B2"/>
            <bitfield mask="0x00000008" name="SR1B3"/>
            <bitfield mask="0x00000010" name="SR1B4"/>
            <bitfield mask="0x00000020" name="SR1B5"/>
            <bitfield mask="0x00000040" name="SR1B6"/>
            <bitfield mask="0x00000080" name="SR1B7"/>
            <bitfield mask="0x00000100" name="SR1B8"/>
            <bitfield mask="0x00000200" name="SR1B9"/>
            <bitfield mask="0x00000400" name="SR1B10"/>
            <bitfield mask="0x00000800" name="SR1B11"/>
            <bitfield mask="0x00001000" name="SR1B12"/>
            <bitfield mask="0x00002000" name="SR1B13"/>
            <bitfield mask="0x00004000" name="SR1B14"/>
            <bitfield mask="0x00008000" name="SR1B15"/>
         </register>
         <register caption="" name="SRCON1E" offset="0x4d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR1E0"/>
            <bitfield mask="0x00000002" name="SR1E1"/>
            <bitfield mask="0x00000004" name="SR1E2"/>
            <bitfield mask="0x00000008" name="SR1E3"/>
            <bitfield mask="0x00000010" name="SR1E4"/>
            <bitfield mask="0x00000020" name="SR1E5"/>
            <bitfield mask="0x00000040" name="SR1E6"/>
            <bitfield mask="0x00000080" name="SR1E7"/>
            <bitfield mask="0x00000100" name="SR1E8"/>
            <bitfield mask="0x00000200" name="SR1E9"/>
            <bitfield mask="0x00000400" name="SR1E10"/>
            <bitfield mask="0x00000800" name="SR1E11"/>
            <bitfield mask="0x00001000" name="SR1E12"/>
            <bitfield mask="0x00002000" name="SR1E13"/>
            <bitfield mask="0x00004000" name="SR1E14"/>
            <bitfield mask="0x00008000" name="SR1E15"/>
         </register>
         <register caption="" name="SRCON1F" offset="0x5d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR1F0"/>
            <bitfield mask="0x00000002" name="SR1F1"/>
            <bitfield mask="0x00000004" name="SR1F2"/>
            <bitfield mask="0x00000008" name="SR1F3"/>
            <bitfield mask="0x00000010" name="SR1F4"/>
            <bitfield mask="0x00000020" name="SR1F5"/>
            <bitfield mask="0x00000040" name="SR1F6"/>
            <bitfield mask="0x00000080" name="SR1F7"/>
            <bitfield mask="0x00000100" name="SR1F8"/>
            <bitfield mask="0x00000200" name="SR1F9"/>
            <bitfield mask="0x00000400" name="SR1F10"/>
            <bitfield mask="0x00000800" name="SR1F11"/>
            <bitfield mask="0x00001000" name="SR1F12"/>
            <bitfield mask="0x00002000" name="SR1F13"/>
            <bitfield mask="0x00004000" name="SR1F14"/>
            <bitfield mask="0x00008000" name="SR1F15"/>
         </register>
         <register caption="" name="SRCON1G" offset="0x6d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR1G0"/>
            <bitfield mask="0x00000002" name="SR1G1"/>
            <bitfield mask="0x00000004" name="SR1G2"/>
            <bitfield mask="0x00000008" name="SR1G3"/>
            <bitfield mask="0x00000010" name="SR1G4"/>
            <bitfield mask="0x00000020" name="SR1G5"/>
            <bitfield mask="0x00000040" name="SR1G6"/>
            <bitfield mask="0x00000080" name="SR1G7"/>
            <bitfield mask="0x00000100" name="SR1G8"/>
            <bitfield mask="0x00000200" name="SR1G9"/>
            <bitfield mask="0x00000400" name="SR1G10"/>
            <bitfield mask="0x00000800" name="SR1G11"/>
            <bitfield mask="0x00001000" name="SR1G12"/>
            <bitfield mask="0x00002000" name="SR1G13"/>
            <bitfield mask="0x00004000" name="SR1G14"/>
            <bitfield mask="0x00008000" name="SR1G15"/>
         </register>
      </register-group>
      <value-group caption="Change Notification Style bit" name="CNCONA__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1"/>
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONA__ON">
         <value caption="CN is enabled" name="" value="0x1"/>
         <value caption="CN is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONB__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1"/>
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONB__ON">
         <value caption="CN is enabled" name="" value="0x1"/>
         <value caption="CN is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONC__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1"/>
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONC__ON">
         <value caption="CN is enabled" name="" value="0x1"/>
         <value caption="CN is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCOND__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1"/>
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0"/>
      </value-group>
