Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ2048EFG100.atdf
         <register caption="Output Compare 'x' Control Register" name="OC5CON" offset="0x800" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC5CON__OCM"/>
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC5CON__OCTSEL"/>
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC5CON__OCFLT"/>
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC5CON__OC32"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC5CON__SIDL"/>
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC5CON__ON"/>
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC6CON" offset="0xa00" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC6CON__OCM"/>
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC6CON__OCTSEL"/>
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC6CON__OCFLT"/>
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC6CON__OC32"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC6CON__SIDL"/>
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC6CON__ON"/>
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC7CON" offset="0xc00" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC7CON__OCM"/>
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC7CON__OCTSEL"/>
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC7CON__OCFLT"/>
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC7CON__OC32"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC7CON__SIDL"/>
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC7CON__ON"/>
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC8CON" offset="0xe00" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC8CON__OCM"/>
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC8CON__OCTSEL"/>
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC8CON__OCFLT"/>
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC8CON__OC32"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC8CON__SIDL"/>
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC8CON__ON"/>
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC9CON" offset="0x1000" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC9CON__OCM"/>
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC9CON__OCTSEL"/>
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC9CON__OCFLT"/>
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC9CON__OC32"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC9CON__SIDL"/>
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC9CON__ON"/>
         </register>
         <register caption="" name="OC1R" offset="0x10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC1R"/>
         </register>
         <register caption="" name="OC2R" offset="0x210" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC2R"/>
         </register>
         <register caption="" name="OC3R" offset="0x410" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC3R"/>
         </register>
         <register caption="" name="OC4R" offset="0x610" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC4R"/>
         </register>
         <register caption="" name="OC5R" offset="0x810" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC5R"/>
         </register>
         <register caption="" name="OC6R" offset="0xa10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC6R"/>
         </register>
         <register caption="" name="OC7R" offset="0xc10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC7R"/>
         </register>
         <register caption="" name="OC8R" offset="0xe10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC8R"/>
         </register>
         <register caption="" name="OC9R" offset="0x1010" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC9R"/>
         </register>
         <register caption="" name="OC1RS" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC1RS"/>
         </register>
         <register caption="" name="OC2RS" offset="0x220" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC2RS"/>
         </register>
         <register caption="" name="OC3RS" offset="0x420" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC3RS"/>
         </register>
         <register caption="" name="OC4RS" offset="0x620" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC4RS"/>
         </register>
         <register caption="" name="OC5RS" offset="0x820" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC5RS"/>
         </register>
         <register caption="" name="OC6RS" offset="0xa20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC6RS"/>
         </register>
         <register caption="" name="OC7RS" offset="0xc20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC7RS"/>
         </register>
         <register caption="" name="OC8RS" offset="0xe20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC8RS"/>
         </register>
