Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ2048EFG100.atdf
         <register caption="" name="RPD3R" offset="0x94" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD3R"/>
         </register>
         <register caption="" name="RPD4R" offset="0x98" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD4R"/>
         </register>
         <register caption="" name="RPD5R" offset="0x9c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD5R"/>
         </register>
         <register caption="" name="RPD9R" offset="0xac" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD9R"/>
         </register>
         <register caption="" name="RPD10R" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD10R"/>
         </register>
         <register caption="" name="RPD11R" offset="0xb4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD11R"/>
         </register>
         <register caption="" name="RPD12R" offset="0xb8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD12R"/>
         </register>
         <register caption="" name="RPD14R" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD14R"/>
         </register>
         <register caption="" name="RPD15R" offset="0xc4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD15R"/>
         </register>
         <register caption="" name="RPE3R" offset="0xd4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE3R"/>
         </register>
         <register caption="" name="RPE5R" offset="0xdc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE5R"/>
         </register>
         <register caption="" name="RPE8R" offset="0xe8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE8R"/>
         </register>
         <register caption="" name="RPE9R" offset="0xec" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE9R"/>
         </register>
         <register caption="" name="RPF0R" offset="0x108" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF0R"/>
         </register>
         <register caption="" name="RPF1R" offset="0x10c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF1R"/>
         </register>
         <register caption="" name="RPF2R" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF2R"/>
         </register>
         <register caption="" name="RPF3R" offset="0x114" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF3R"/>
         </register>
         <register caption="" name="RPF4R" offset="0x118" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF4R"/>
         </register>
         <register caption="" name="RPF5R" offset="0x11c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF5R"/>
         </register>
         <register caption="" name="RPF8R" offset="0x128" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF8R"/>
         </register>
         <register caption="" name="RPF12R" offset="0x138" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF12R"/>
         </register>
         <register caption="" name="RPF13R" offset="0x13c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF13R"/>
         </register>
         <register caption="" name="RPG0R" offset="0x148" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG0R"/>
         </register>
         <register caption="" name="RPG1R" offset="0x14c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG1R"/>
         </register>
         <register caption="" name="RPG6R" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG6R"/>
         </register>
         <register caption="" name="RPG7R" offset="0x164" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG7R"/>
         </register>
         <register caption="" name="RPG8R" offset="0x168" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG8R"/>
         </register>
         <register caption="" name="RPG9R" offset="0x16c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG9R"/>
         </register>
      </register-group>
   </module>
   <module caption="" id="00748" name="RTCC" version="2">
      <register-group name="RTCC">
         <register caption="Real-Time Clock and Calendar Control Register" name="RTCCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="RTCC Output Enable bit" mask="0x00000001" name="RTCOE" values="RTCCON__RTCOE"/>
            <bitfield caption="Half-Second Status bit" mask="0x00000002" name="HALFSEC" values="RTCCON__HALFSEC"/>
            <bitfield caption="Real-Time Clock Value Registers Read Synchronization bit" mask="0x00000004" name="RTCSYNC" values="RTCCON__RTCSYNC"/>
            <bitfield caption="Real-Time Clock Value Registers Write Enable bit" mask="0x00000008" name="RTCWREN" values="RTCCON__RTCWREN"/>
            <bitfield caption="RTCC Clock Enable Status bit" mask="0x00000040" name="RTCCLKON" values="RTCCON__RTCCLKON"/>
            <bitfield caption="RTCC Output Data Select bits" mask="0x00000180" name="RTCOUTSEL" values="RTCCON__RTCOUTSEL"/>
            <bitfield caption="RTCC Clock Select bits" mask="0x00000600" name="RTCCLKSEL" values="RTCCON__RTCCLKSEL"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="RTCCON__SIDL"/>
            <bitfield caption="RTCC On bit" mask="0x00008000" name="ON" values="RTCCON__ON"/>
            <bitfield caption="Real-Time Clock Drift Calibration bits" mask="0x03FF0000" name="CAL" values="RTCCON__CAL"/>
         </register>
         <register caption="Real-Time Clock ALARM Control Register" name="RTCALRM" offset="0x10" rw="RW" size="4">
            <bitfield caption="Alarm Repeat Counter Value bits" mask="0x000000FF" name="ARPT" values="RTCALRM__ARPT"/>
            <bitfield caption="Alarm Mask Configuration bits" mask="0x00000F00" name="AMASK" values="RTCALRM__AMASK"/>
            <bitfield caption="Alarm Sync bit" mask="0x00001000" name="ALRMSYNC" values="RTCALRM__ALRMSYNC"/>
            <bitfield caption="Alarm Pulse Initial Value bit" mask="0x00002000" name="PIV" values="RTCALRM__PIV"/>
            <bitfield caption="Chime Enable bit" mask="0x00004000" name="CHIME" values="RTCALRM__CHIME"/>
            <bitfield caption="Alarm Enable bit" mask="0x00008000" name="ALRMEN" values="RTCALRM__ALRMEN"/>
         </register>
         <register caption="Real-Time Clock Time Value Register" name="RTCTIME" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x00000F00" name="SEC01"/>
            <bitfield mask="0x0000F000" name="SEC10"/>
            <bitfield mask="0x000F0000" name="MIN01"/>
            <bitfield mask="0x00F00000" name="MIN10"/>
            <bitfield mask="0x0F000000" name="HR01"/>
            <bitfield mask="0xF0000000" name="HR10"/>
         </register>
         <register caption="Real-Time Clock Date Value Register" name="RTCDATE" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="WDAY01"/>
            <bitfield mask="0x00000F00" name="DAY01"/>
            <bitfield mask="0x0000F000" name="DAY10"/>
            <bitfield mask="0x000F0000" name="MONTH01"/>
            <bitfield mask="0x00F00000" name="MONTH10"/>
            <bitfield mask="0x0F000000" name="YEAR01"/>
            <bitfield mask="0xF0000000" name="YEAR10"/>
         </register>
         <register caption="Alarm Time Value Register" name="ALRMTIME" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000F00" name="SEC01"/>
            <bitfield mask="0x0000F000" name="SEC10"/>
            <bitfield mask="0x000F0000" name="MIN01"/>
            <bitfield mask="0x00F00000" name="MIN10"/>
            <bitfield mask="0x0F000000" name="HR01"/>
            <bitfield mask="0xF0000000" name="HR10"/>
         </register>
